/* 
  Localizable.strings
  dialog

  Created by Bart Reardon on 29/5/2022.
  
*/

// error sheet
"invalid-input" = "One or more input fields are incorrect";
"is-required" = "is required";
"no-pattern" = "doesn't match the required format";

// required fields text
"required-note" = "* Required Fields";

//buttons
"button-cancel" = "Cancel";
"button-more-info" = "More Information";
"button-ok" = "OK";
"button-select" = "Select";

//default text
"default-title" = "An Important Message";
"default-message" = "This contains important message content\n\nPlease read";
"help-hover" = "Click for additional information";

"Confirm" = "Confirm";

"confirmation-failed" = "confirmation failed  <br>values do not match";

//constructor kit labels
"ck-welcome"            = "Welcome to the swiftDialog builder";
"ck-welcomeinfo"        = "Select properties on the left to modify. swiftDialog will update to show the changes in realtime";
"ck-basic"              = "Basic";
"ck-content"            = "Content";
"ck-window"             = "Window";
"ck-sidebar"            = "Sidebar";
"ck-dataentry"          = "Data Entry";
"ck-buttons"            = "Buttons";
"ck-buttonsize"         = "Button Size";
"ck-advanced"           = "Advanced";
"ck-listitems"          = "List Items";
"ck-images"             = "Images";
"ck-media"              = "Media";
"ck-output"             = "Output";
"ck-jsonoutput"         = "JSON Output";
"ck-quit"               = "Quit";
"ck-exportcommand"      = "Export Command";
"ck-title"              = "Title";
"ck-colour"             = "Colour";
"ck-reset"              = "Reset";
"ck-fontsize"           = "Font Size: ";
"ck-value"              = "value:";
"ck-message"            = "Message";
"ck-textalignmnet"      = "Text Alignment";
"ck-verticalposition"   = "Vertical Position";
"ck-windowheight"       = "Window Height";
"ck-heightvalue"        = "Height value:";
"ck-windowwidth"        = "Window Width";
"ck-widthvalue"         = "Width value:";
"ck-windowproperties"   = "Window Properties";
"ck-presetsizes"        = "Preset Sizes";
"ck-small"              = "Small";
"ck-big"                = "Big";
"ck-screenblur"         = "Screen Background Blur";
"ck-movable"            = "Movable";
"ck-forceontop"         = "Force on Top";
"ck-progressbar"        = "Progress Bar";
"ck-progressvalue"      = "Progress value:";
"ck-progresstext"       = "Progress Text:";
"ck-bannerimage"        = "Banner Image";
"ck-select"             = "Select";
"ck-watermark"          = "Watermark";
"ck-fill"               = "Fill";
"ck-alpha"              = "Alpha";
"ck-scale"              = "Scale";
"ck-position"           = "Position";
"ck-icon"               = "Icon";
"ck-visible"            = "Visible";
"ck-centred"            = "Centred";
"ck-select"             = "Select";
"ck-iconsize"           = "Icon Size";
"ck-sizevalue"          = "Size value:";
"ck-overlay"            = "Overlay";
"ck-infobox"            = "Infobox";
"ck-infotext"           = "Infotext";
"ck-infotextlabel"      = "Info Text";
"ck-button1"            = "Button1";
"ck-button2"            = "Button2";
"ck-infobuttonlabel"    = "Info Button";
"ck-quitoninfo"         = "Quit on Info";
"ck-label"              = "Label: ";
"ck-infobuttonaction"   = "Info Button Action: ";
"ck-autoplay"           = "AutoPlay";
"ck-autoplayseconds"    = "Autoplay Seconds";
"ck-path"               = "Path";
"ck-caption"            = "Caption";
"ck-statustext"         = "Status Text";
"ck-status"             = "Status";
"ck-formatjson"         = "Format output as JSON";
"ck-textfields"         = "Textfields";
"ck-show"               = "Show";
"ck-required"           = "Required";
"ck-secure"             = "Secure";
"ck-prompt"             = "Prompt";
"ck-regex"              = "Regex";
"ck-regexerror"         = "Regex Error";
"ck-select"             = "Select";
"ck-checkbox"           = "Checkbox";
"ck-video"              = "Video";
"ck-filename"           = "Filename";
"ck-web"                = "Web";
"ck-url"                = "URL";
"ck-disabled"           = "Disabled";
"ck-enabled"            = "Enabled";
